config/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://itau.com.co/services/security/validatepassword/v1/schemas" xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">

   <soapenv:Header/>

   <soapenv:Body>

      <sch:doValidatePasswordRq>

         <sch:HeaderRequest>

            <!--Optional:-->

            <sch1:MessageHeader>

               <!--Optional:-->

               <sch1:MessageKey>

                  <!--Optional:-->

                  <sch1:integrationId>?</sch1:integrationId>

                  <!--Optional:-->

                  <sch1:requestVersion>?</sch1:requestVersion>

                  <sch1:requestUUID>?</sch1:requestUUID>

               </sch1:MessageKey>

               <!--Optional:-->

               <sch1:MessageInfo>

                  <sch1:dateTime>?</sch1:dateTime>

                  <sch1:systemId>?</sch1:systemId>

                  <!--Optional:-->

                  <sch1:originatorName>?</sch1:originatorName>

                  <sch1:originatorType>?</sch1:originatorType>

                  <sch1:terminalId>?</sch1:terminalId>

                  <!--Optional:-->

                  <sch1:terminalType>?</sch1:terminalType>

                  <!--Optional:-->

                  <sch1:bankIdType>?</sch1:bankIdType>

                  <!--Optional:-->

                  <sch1:bankId>?</sch1:bankId>

                  <!--Optional:-->

                  <sch1:trnType>?</sch1:trnType>

               </sch1:MessageInfo>

               <!--Optional:-->

               <sch1:TrnInfoList>

                  <!--Zero or more repetitions:-->

                  <sch1:TrnInfo>

                     <!--Optional:-->

                     <sch1:trnCode>?</sch1:trnCode>

                     <!--Optional:-->

                     <sch1:trnSrc>?</sch1:trnSrc>

                  </sch1:TrnInfo>

               </sch1:TrnInfoList>

            </sch1:MessageHeader>

            <!--Optional:-->

            <sch1:User>

               <!--Optional:-->

               <sch1:userName>?</sch1:userName>

               <!--Optional:-->

               <sch1:userToken>?</sch1:userToken>

               <!--Optional:-->

               <sch1:employeeIdentlNum>?</sch1:employeeIdentlNum>

            </sch1:User>

         </sch:HeaderRequest>

         <sch:CustId>

            <!--Optional:-->

            <sch1:SPName>?</sch1:SPName>

            <!--Optional:-->

            <sch1:custPermId>?</sch1:custPermId>

            <!--Optional:-->

            <sch1:custLoginId>?</sch1:custLoginId>

            <!--Optional:-->

            <sch1:custType>?</sch1:custType>

         </sch:CustId>

         <sch:pswd>?</sch:pswd>

      </sch:doValidatePasswordRq>

   </soapenv:Body>

</soapenv:Envelope>